package com.icc.daelimbada.article.domain;

import java.util.Map;
import java.util.stream.Collectors;
import java.util.stream.Stream;

public enum Major {

    // 공학분야
    AI시스템과(101, "AI시스템과"),
    로봇자동화공학과(102, "로봇자동화공학과"),
    응용SW전공(103, "응용SW전공"),
    건축과(104, "건축과"),
    기계공학과(105, "기계공학과"),
    미래자동차학부(106, "미래자동차학부"),
    방송음향영상학부(107, "방송음향영상학부"),
    방송음향기술과(108, "방송음향기술과"),
    영상디자인과(109, "영상디자인과"),
    산업경영과(110, "산업경영과"),
    소방안전설비과(111, "소방안전설비과"),
    전자통신과(112, "전자통신과"),
    메카트로닉스전공(113, "메카트로닉스전공"),
    스마트팩토리학부(114, "스마트팩토리학부"),
    반도체장비전공(115, "반도체장비전공"),
    스마트자동화전공(116, "스마트자동화전공"),
    실내디자인학부(117, "실내디자인학부"),
    의공융합과(118, "의공융합과"),
    전기공학과(119, "전기공학과"),
    컴퓨터정보학부(120, "컴퓨터정보학부"),
    건설환경공학과(121, "건설환경공학과"),
    반도체학과(122, "반도체학과"),

    // 인문사회분야
    경영학과(201, "경영학과"),
    도서관미디어정보과(202, "도서관미디어정보과"),
    사무행정학과(203, "사무행정학과"),
    사회복지과(204, "사회복지과"),
    유아교육과(205, "유아교육과"),
    항공서비스과(206, "항공서비스과"),
    호텔레저학과(207, "호텔레저학과"),
    아동보육과(208, "아동보육과"),

    // 그 외 (예체능, 보건, 제빵)
    스포츠지도과(301, "스포츠지도과"),
    스포츠재활과(302, "스포츠재활과"),
    제과제빵과(303, "제과제빵과"),
    호텔조리과(304, "호텔조리과"),
    보건안전학과(305, "보건안전학과"),
    보건의료공학과(306, "보건의료공학과"),
    보건의료행정과(307, "보건의료행정과"),
    언어치료학과(308, "언어치료학과"),
    해군기술부사관과(309, "해군기술부사관과"),
    
    // 교양
    교양(400, "교양");

    private final int code;
    private final String major;

    Major(int code, String major) {
        this.code = code;
        this.major = major;
    }

    public int getCode() {
        return code;
    }

    private static final Map<Integer, Major> BY_CODE =
            Stream.of(values()).collect(Collectors.toMap(Major::getCode, e -> e));

    public static Major getMajor(int code) {
        return BY_CODE.get(code);
    }
}
